Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
			</registers>
		</peripheral>
        <peripheral>
			<name>EXTI</name>
			<description>EXTI</description>
			<groupName>EXTI</groupName>
			<baseAddress>0x40010400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EXTI0_6</name>
				<description>EXTI0_6 global interrupt</description>
				<value>2</value>
			</interrupt>
			<registers>
				<register>
					<name>EXTI_EMASK</name>
					<displayName>EXTI_EMASK</displayName>
					<description>nan</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EMASKx</name>
							<description>EMASKx</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTI_IMASK</name>
					<displayName>EXTI_IMASK</displayName>
					<description>nan</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IMASKx</name>
							<description>IMASKx</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTI_FT_CFG</name>
					<displayName>EXTI_FT_CFG</displayName>
					<description>nan</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FT_CFGx</name>
							<description>FT_CFGx</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTI_RT_CFG</name>
					<displayName>EXTI_RT_CFG</displayName>
					<description>nan</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RT_CFGx</name>
							<description>RT_CFGx</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTI_PEND</name>
					<displayName>EXTI_PEND</displayName>
					<description>nan</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PEND10</name>
							<description>PEND10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEND9</name>
							<description>PEND9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEND8</name>
							<description>PEND8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEND7</name>
							<description>PEND7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEND6</name>
							<description>PEND6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEND5</name>
							<description>PEND5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEND4</name>
							<description>PEND4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEND3</name>
							<description>PEND3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEND2</name>
							<description>PEND2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEND1</name>
							<description>PEND1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEND0</name>
							<description>PEND0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTI_SWIE</name>
					<displayName>EXTI_SWIE</displayName>
					<description>nan</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SWIEx</name>
							<description>SWIEx</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
        <peripheral>
            <name>FLASH</name>
            <description>interal FLASH controller</description>
            <groupName>FLASH</groupName>
            <baseAddress>0x40022000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>FLASH</name>
                <description>FLASH interrupt</description>
                <value>1</value>
            </interrupt>
            <registers>
                <register>
                    <name>FLASH_AC</name>
                    <displayName>FLASH_AC</displayName>
                    <description>nan</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0030</resetValue>
                    <fields>
                        <field>
                            <name>LATENCY</name>
                            <description>LATENCY</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_KEY</name>
                    <displayName>FLASH_KEY</displayName>
                    <description>nan</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>FKEY</name>
                            <description>FKEY</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_OPTKEY</name>
                    <displayName>FLASH_OPTKEY</displayName>
                    <description>nan</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>OPTKEY</name>
                            <description>OPTKEY</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_STS</name>
                    <displayName>FLASH_STS</displayName>
                    <description>nan</description>
                    <addressOffset>0x0c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>EOP</name>
                            <description>EOP</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRPERR</name>
                            <description>WRPERR</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PGERR</name>
                            <description>PGERR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>BUSY</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_CTRL</name>
                    <displayName>FLASH_CTRL</displayName>
                    <description>nan</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0080</resetValue>
                    <fields>
                        <field>
                            <name>EOPITE</name>
                            <description>EOPITE</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRITE</name>
                            <description>ERRITE</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OPTWE</name>
                            <description>OPTWE</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK</name>
                            <description>LOCK</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>START</name>
                            <description>START</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OPTER</name>
                            <description>OPTER</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OPTPG</name>
                            <description>OPTPG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MER</name>
                            <description>MER</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PER</name>
                            <description>PER</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PG</name>
                            <description>PG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_ADD</name>
                    <displayName>FLASH_ADD</displayName>
                    <description>nan</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>FADD</name>
                            <description>FADD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_OB2</name>
                    <displayName>FLASH_OB2</displayName>
                    <description>nan</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xffff</resetValue>
                    <fields>
                        <field>
                            <name>Data1</name>
                            <description>Data1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>Data0</name>
                            <description>Data0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_OB</name>
                    <displayName>FLASH_OB</displayName>
                    <description>nan</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0ffffffc</resetValue>
                    <fields>
                        <field>
                            <name>RDPRT2</name>
                            <description>RDPRT2</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BOOT_SEL</name>
                            <description>BOOT_SEL</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BOOT0_CFG</name>
                            <description>BOOT0_CFG</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>nSWBOOT0</name>
                            <description>nSWBOOT0</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>nBOOT1</name>
                            <description>nBOOT1</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>nBOOT0</name>
                            <description>nBOOT0</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>POR_DELAY</name>
                            <description>POR_DELAY</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>NRST_PF3</name>
                            <description>NRST_PF3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDG_SW</name>
                            <description>IWDG_SW</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDPRT1</name>
                            <description>RDPRT1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OBERR</name>
                            <description>OBERR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_WRP</name>
                    <displayName>FLASH_WRP</displayName>
                    <description>nan</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000ffff</resetValue>
                    <fields>
                        <field>
                            <name>WRPT</name>
                            <description>WRPT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLASH_VTOR</name>
                    <displayName>FLASH_VTOR</displayName>
                    <description>nan</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>VTOR_EN</name>
                            <description>VTOR_EN</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VTOR_VALUE</name>
                            <description>VTOR_VALUE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>31</bitWidth>
                        </field>
                    </fields>
                </register>
