Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
				<register>
					<name>GPIOA_AFH</name>
					<displayName>GPIOA_AFH</displayName>
					<description>PortA Alternate function High register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xF00FFFFF</resetValue>
					<fields>
						<field>
							<name>AFSEL15</name>
							<description>AFSEL15</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL14</name>
							<description>AFSEL14</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL13</name>
							<description>AFSEL13</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL12</name>
							<description>AFSEL12</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL11</name>
							<description>AFSEL11</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL10</name>
							<description>AFSEL10</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL9</name>
							<description>AFSEL9</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL8</name>
							<description>AFSEL8</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOA_PBC</name>
					<displayName>GPIOA_PBC</displayName>
					<description>PortA bit reset register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PBC15</name>
							<description>PBC15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC14</name>
							<description>PBC14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC13</name>
							<description>PBC13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC12</name>
							<description>PBC12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC11</name>
							<description>PBC11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC10</name>
							<description>PBC10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC9</name>
							<description>PBC9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC8</name>
							<description>PBC8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC7</name>
							<description>PBC7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC6</name>
							<description>PBC6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC5</name>
							<description>PBC5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC4</name>
							<description>PBC4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC3</name>
							<description>PBC3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC2</name>
							<description>PBC2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC1</name>
							<description>PBC1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC0</name>
							<description>PBC0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
                <register>
					<name>GPIOB_PMODE</name>
					<displayName>GPIOB_PMODE</displayName>
					<description>GPIO mode description register</description>
					<addressOffset>0x0100</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x3FFFF</resetValue>
					<fields>
						<field>
							<name>PMODE8</name>
							<description>PMODE8</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE7</name>
							<description>PMODE7</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE6</name>
							<description>PMODE6</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE5</name>
							<description>PMODE5</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE4</name>
							<description>PMODE4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE3</name>
							<description>PMODE3</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE2</name>
							<description>PMODE2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE1</name>
							<description>PMODE1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE0</name>
							<description>PMODE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
                <register>
					<name>GPIOB_POTYPE</name>
					<displayName>GPIOB_POTYPE</displayName>
					<description>GPIO type defenition</description>
					<addressOffset>0x0104</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>POT8</name>
							<description>POT8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POT7</name>
							<description>POT7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POT6</name>
							<description>POT6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POT5</name>
							<description>POT5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POT2</name>
							<description>POT2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOB_PUPD</name>
					<displayName>GPIOB_PUPD</displayName>
					<description>GPIO pull up pull down description register</description>
					<addressOffset>0x010C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PUPD8</name>
							<description>PUPD8</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD7</name>
							<description>PUPD7</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD6</name>
							<description>PUPD6</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD5</name>
							<description>PUPD5</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD4</name>
							<description>PUPD4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD3</name>
							<description>PUPD3</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD2</name>
							<description>PUPD2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD1</name>
							<description>PUPD1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD0</name>
							<description>PUPD0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOB_PID</name>
					<displayName>GPIOB_PID</displayName>
					<description>GPIO input data register</description>
					<addressOffset>0x0110</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID8</name>
							<description>PID8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID7</name>
							<description>PID7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID6</name>
							<description>PID6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID5</name>
							<description>PID5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID4</name>
							<description>PID4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID3</name>
							<description>PID3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID2</name>
							<description>PID2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID1</name>
							<description>PID1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID0</name>
							<description>PID0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOB_POD</name>
					<displayName>GPIOB_POD</displayName>
					<description>GPIO output data register</description>
					<addressOffset>0x0114</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>POD8</name>
							<description>POD8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD7</name>
							<description>POD7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD6</name>
							<description>POD6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD5</name>
							<description>POD5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD4</name>
							<description>POD4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD3</name>
							<description>POD3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD2</name>
							<description>POD2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD1</name>
							<description>POD1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD0</name>
							<description>POD0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
                <register>
					<name>GPIOB_PBSC</name>
					<displayName>GPIOB_PBSC</displayName>
					<description>PortB bit set/reset register</description>
					<addressOffset>0x0118</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PBC8</name>
							<description>PBC8</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC7</name>
							<description>PBC7</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC6</name>
							<description>PBC6</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC5</name>
							<description>PBC5</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC4</name>
							<description>PBC4</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC3</name>
							<description>PBC3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC2</name>
							<description>PBC2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC1</name>
							<description>PBC1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC0</name>
							<description>PBC0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS8</name>
							<description>PBS8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS7</name>
							<description>PBS7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS6</name>
							<description>PBS6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS5</name>
							<description>PBS5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS4</name>
							<description>PBS4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS3</name>
							<description>PBS3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS2</name>
							<description>PBS2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS1</name>
							<description>PBS1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS0</name>
							<description>PBS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOB_PLOCK</name>
					<displayName>GPIOB_PLOCK</displayName>
					<description>PortB configuration lock register</description>
					<addressOffset>0x011C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PLOCKK</name>
							<description>PLOCKK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK8</name>
							<description>PLOCK8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK7</name>
							<description>PLOCK7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK6</name>
							<description>PLOCK6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK5</name>
							<description>PLOCK5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK4</name>
							<description>PLOCK4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK3</name>
							<description>PLOCK3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK2</name>
							<description>PLOCK2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK1</name>
							<description>PLOCK1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK0</name>
							<description>PLOCK0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOB_AFL</name>
					<displayName>GPIOB_AFL</displayName>
					<description>PortB Alternate function low register</description>
					<addressOffset>0x0120</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>AFSEL7</name>
							<description>AFSEL7</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL6</name>
							<description>AFSEL6</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL5</name>
							<description>AFSEL5</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL4</name>
							<description>AFSEL4</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL3</name>
							<description>AFSEL3</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL2</name>
							<description>AFSEL2</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL1</name>
							<description>AFSEL1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL0</name>
							<description>AFSEL0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOB_AFH</name>
					<displayName>GPIOB_AFH</displayName>
					<description>PortB Alternate function High register</description>
					<addressOffset>0x0124</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xF</resetValue>
					<fields>
						<field>
							<name>AFSEL8</name>
							<description>AFSEL8</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOB_PBC</name>
					<displayName>GPIOB_PBC</displayName>
					<description>PortB bit reset register</description>
					<addressOffset>0x0128</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PBC8</name>
							<description>PBC8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC7</name>
							<description>PBC7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC6</name>
							<description>PBC6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC5</name>
							<description>PBC5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC4</name>
							<description>PBC4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC3</name>
							<description>PBC3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC2</name>
							<description>PBC2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC1</name>
							<description>PBC1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC0</name>
							<description>PBC0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
                <register>
					<name>GPIOB_DS</name>
					<displayName>GPIOB_DS</displayName>
					<description>PortB driver strength config register</description>
					<addressOffset>0x012C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x738</resetValue>
					<fields>
						<field>
							<name>SR5</name>
							<description>SR5</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SR4</name>
							<description>SR4</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SR3</name>
							<description>SR3</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DS5</name>
							<description>DS5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DS4</name>
							<description>DS4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DS3</name>
							<description>DS3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
                <register>
					<name>GPIOF_PMODE</name>
					<displayName>GPIOF_PMODE</displayName>
					<description>GPIO mode description register</description>
					<addressOffset>0x0200</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFF</resetValue>
					<fields>
						<field>
							<name>PMODE3</name>
							<description>PMODE3</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE2</name>
							<description>PMODE2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE1</name>
							<description>PMODE1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PMODE0</name>
							<description>PMODE0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
