Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
				<register>
					<name>GPIOF_POTYPE</name>
					<displayName>GPIOF_POTYPE</displayName>
					<description>GPIO type defenition</description>
					<addressOffset>0x0204</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>POT1</name>
							<description>POT1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POT0</name>
							<description>POT0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOF_PUPD</name>
					<displayName>GPIOF_PUPD</displayName>
					<description>GPIO pull up pull down description register</description>
					<addressOffset>0x020C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PUPD3</name>
							<description>PUPD3</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD2</name>
							<description>PUPD2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD1</name>
							<description>PUPD1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PUPD0</name>
							<description>PUPD0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOF_PID</name>
					<displayName>GPIOF_PID</displayName>
					<description>GPIO input data register</description>
					<addressOffset>0x0210</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PID3</name>
							<description>PID3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID2</name>
							<description>PID2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID1</name>
							<description>PID1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PID0</name>
							<description>PID0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOF_POD</name>
					<displayName>GPIOF_POD</displayName>
					<description>GPIO output data register</description>
					<addressOffset>0x0214</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>POD3</name>
							<description>POD3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD2</name>
							<description>POD2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD1</name>
							<description>POD1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POD0</name>
							<description>POD0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOF_PBSC</name>
					<displayName>GPIOF_PBSC</displayName>
					<description>PortF bit set/reset register</description>
					<addressOffset>0x0218</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PBC3</name>
							<description>PBC3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC2</name>
							<description>PBC2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC1</name>
							<description>PBC1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC0</name>
							<description>PBC0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS3</name>
							<description>PBS3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS2</name>
							<description>PBS2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS1</name>
							<description>PBS1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBS0</name>
							<description>PBS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOF_PLOCK</name>
					<displayName>GPIOF_PLOCK</displayName>
					<description>PortF configuration lock register</description>
					<addressOffset>0x021C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PLOCKK</name>
							<description>PLOCKK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK3</name>
							<description>PLOCK3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK2</name>
							<description>PLOCK2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK1</name>
							<description>PLOCK1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLOCK0</name>
							<description>PLOCK0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOF_AFL</name>
					<displayName>GPIOF_AFL</displayName>
					<description>PortF Alternate function low register</description>
					<addressOffset>0x0220</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<fields>
						<field>
							<name>AFSEL3</name>
							<description>AFSEL3</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL2</name>
							<description>AFSEL2</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL1</name>
							<description>AFSEL1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFSEL0</name>
							<description>AFSEL0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>GPIOF_PBC</name>
					<displayName>GPIOF_PBC</displayName>
					<description>PortF bit reset register</description>
					<addressOffset>0x0228</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PBC3</name>
							<description>PBC3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC2</name>
							<description>PBC2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC1</name>
							<description>PBC1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PBC0</name>
							<description>PBC0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AFIO_CFG</name>
					<displayName>AFIO_CFG</displayName>
					<description>Mapping configurations</description>
					<addressOffset>0x0300</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x3800</resetValue>
					<fields>
						<field>
							<name>SPI2_NSS</name>
							<description>SPI2_NSS</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1_NSS</name>
							<description>SPI1_NSS</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTI_ETRR</name>
							<description>EXTI_ETRR</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>EXTIFLITEN</name>
							<description>EXTIFLITEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOFLITCFG</name>
							<description>IOFLITCFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AFIO_EXTI_CFG1</name>
					<displayName>AFIO_EXTI_CFG1</displayName>
					<description>EXTI line configuration (0-3)</description>
					<addressOffset>0x0308</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x7777</resetValue>
					<fields>
						<field>
							<name>EXTI3_CFG</name>
							<description>EXTI3_CFG</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>EXTI2_CFG</name>
							<description>EXTI2_CFG</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>EXTI1_CFG</name>
							<description>EXTI1_CFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>EXTI0_CFG</name>
							<description>EXTI0_CFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AFIO_EXTI_CFG2</name>
					<displayName>AFIO_EXTI_CFG2</displayName>
					<description>EXTI line configuration (4-7)</description>
					<addressOffset>0x030c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x777</resetValue>
					<fields>
						<field>
							<name>EXTI6_CFG</name>
							<description>EXTI6_CFG</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>EXTI5_CFG</name>
							<description>EXTI5_CFG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>EXTI4_CFG</name>
							<description>EXTI4_CFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AFIO_DIGEFT_CFG1</name>
					<displayName>AFIO_DIGEFT_CFG1</displayName>
					<description>GPIO type defenition</description>
					<addressOffset>0x0310</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PAyDIGEFTEN</name>
							<description>PAyDIGEFTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AFIO_DIGEFT_CFG2</name>
					<displayName>AFIO_DIGEFT_CFG2</displayName>
					<description>GPIO type defenition</description>
					<addressOffset>0x0314</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PByDIGEFTEN</name>
							<description>PByDIGEFTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AFIO_DIGEFT_CFG3</name>
					<displayName>AFIO_DIGEFT_CFG3</displayName>
					<description>GPIO type defenition</description>
					<addressOffset>0x0318</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PFyDIGEFTEN</name>
							<description>PFyDIGEFTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
