Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
			</registers>
		</peripheral>
        
        <peripheral>
			<name>I2C1</name>
			<description>I2C1</description>
			<groupName>I2C</groupName>
			<baseAddress>0x40005400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
                <name>I2C1_EV</name>
                <description>I2C1 EV interrupt</description>
                <value>16</value>
            </interrupt> 
            <interrupt>
                <name>I2C1_ER</name>
                <description>I2C1 ER interrupt</description>
                <value>17</value>
            </interrupt>
			<registers>
				<register>
					<name>I2C_CTRL1</name>
					<displayName>I2C_CTRL1</displayName>
					<description>nan</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>LTOSEL</name>
							<description>LTOSEL</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>HTOSEL</name>
							<description>HTOSEL</description>
							<bitOffset>27</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SWRESET</name>
							<description>SWRESET</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SMBALERT</name>
							<description>SMBALERT</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEC</name>
							<description>PEC</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ACKPOS</name>
							<description>ACKPOS</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ACKEN</name>
							<description>ACKEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STOPGEN</name>
							<description>STOPGEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STARTGEN</name>
							<description>STARTGEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NOEXTEND</name>
							<description>NOEXTEND</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GCEN</name>
							<description>GCEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PECEN</name>
							<description>PECEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ARPEN</name>
							<description>ARPEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SMBTYPE</name>
							<description>SMBTYPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SMBMODE</name>
							<description>SMBMODE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_CTRL2</name>
					<displayName>I2C_CTRL2</displayName>
					<description>nan</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>LTOEN</name>
							<description>LTOEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HTOEN</name>
							<description>HTOEN</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SCLLTOINTEN</name>
							<description>SCLLTOINTEN</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SCLHTOINTEN</name>
							<description>SCLHTOINTEN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDALTOINTEN</name>
							<description>SDALTOINTEN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMAEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ERRINTEN</name>
							<description>ERRINTEN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EVTINTEN</name>
							<description>EVTINTEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BUFINTEN</name>
							<description>BUFINTEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMALAST</name>
							<description>DMALAST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CLKFREQ</name>
							<description>CLKFREQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_OADDR1</name>
					<displayName>I2C_OADDR1</displayName>
					<description>nan</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>ADDRMODE</name>
							<description>ADDRMODE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADDR_H</name>
							<description>ADDR_H</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ADDR</name>
							<description>ADDR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>ADDR0</name>
							<description>ADDR0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_OADDR2</name>
					<displayName>I2C_OADDR2</displayName>
					<description>nan</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>ADDR2</name>
							<description>ADDR2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>DUALEN</name>
							<description>DUALEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_DAT</name>
					<displayName>I2C_DAT</displayName>
					<description>nan</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>DAT</name>
							<description>DAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_STS1</name>
					<displayName>I2C_STS1</displayName>
					<description>nan</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SCLLTO</name>
							<description>SCLLTO</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SCLHTO</name>
							<description>SCLHTO</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDALTO</name>
							<description>SDALTO</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SMBALERT</name>
							<description>SMBALERT</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMEOUT</name>
							<description>TIMEOUT</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PECERR</name>
							<description>PECERR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVERRUN</name>
							<description>OVERRUN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BUSERR</name>
							<description>BUSERR</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ARLOST</name>
							<description>ARLOST</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ACKFAIL</name>
							<description>ACKFAIL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADDR10F</name>
							<description>ADDR10F</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXDATE</name>
							<description>TXDATE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXDATNE</name>
							<description>RXDATNE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STOPF</name>
							<description>STOPF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BSF</name>
							<description>BSF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADDRF</name>
							<description>ADDRF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STARTBF</name>
							<description>STARTBF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_STS2</name>
					<displayName>I2C_STS2</displayName>
					<description>nan</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>PECVAL</name>
							<description>PECVAL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>SMBHADDR</name>
							<description>SMBHADDR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SMBDADDR</name>
							<description>SMBDADDR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DUALFLAG</name>
							<description>DUALFLAG</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GCALLADDR</name>
							<description>GCALLADDR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TRF</name>
							<description>TRF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MSMODE</name>
							<description>MSMODE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BUSY</name>
							<description>BUSY</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_CLKCTRL</name>
					<displayName>I2C_CLKCTRL</displayName>
					<description>nan</description>
					<addressOffset>0x1c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>DUTY</name>
							<description>DUTY</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FSMODE</name>
							<description>FSMODE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CLKCTRL</name>
							<description>CLKCTRL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_TMRISE</name>
					<displayName>I2C_TMRISE</displayName>
					<description>nan</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x02</resetValue>
					<fields>
						<field>
							<name>TMRISE</name>
							<description>TMRISE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>I2C_GFLTRCTRL</name>
					<displayName>I2C_GFLTRCTRL</displayName>
					<description>Filter control register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>SCLAFENN</name>
							<description>SCLAFENN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SCLAFW</name>
							<description>SCLAFW</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SDAAFENN</name>
							<description>SDAAFENN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDAAFW</name>
							<description>SDAAFW</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SCLDFW</name>
							<description>SCLDFW</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>SDADFW</name>
							<description>SDADFW</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
