Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
			</registers>
		</peripheral>
    
        <peripheral derivedFrom="I2C1">
            <name>I2C2</name>
            <baseAddress>0x40005800</baseAddress>
            <interrupt>
                <name>I2C2_EV</name>
                <description>I2C2 EV interrupt</description>
                <value>25</value>
            </interrupt> 
            <interrupt>
                <name>I2C2_ER</name>
                <description>I2C2 ER interrupt</description>
                <value>26</value>
            </interrupt>
		</peripheral>
        
        <peripheral>
			<name>IWDG</name>
			<description>IWDG</description>
			<groupName>IWDG</groupName>
			<baseAddress>0x40003000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>IWDG</name>
				<description>IWDG global interrupt</description>
				<value>10</value>
			</interrupt>
			<registers>
				<register>
					<name>IWDG_KEY</name>
					<displayName>IWDG_KEY</displayName>
					<description>nan</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>KEYV</name>
							<description>KEYV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IWDG_STS</name>
					<displayName>IWDG_STS</displayName>
					<description>nan</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FREF</name>
							<description>FREF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRVU</name>
							<description>CRVU</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVU</name>
							<description>PVU</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IWDG_PREDIV</name>
					<displayName>IWDG_PREDIV</displayName>
					<description>nan</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PD</name>
							<description>PD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IWDG_RELV</name>
					<displayName>IWDG_RELV</displayName>
					<description>nan</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000fff</resetValue>
					<fields>
						<field>
							<name>REL</name>
							<description>REL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IWDG_CTRL</name>
					<displayName>IWDG_CTRL</displayName>
					<description>nan</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ITE</name>
							<description>ITE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
        
        <peripheral>
			<name>OPAMP</name>
			<description>OPAMP</description>
			<groupName>OPAMP</groupName>
			<baseAddress>0x40002000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>OPAMP1_CS</name>
					<displayName>OPAMP1_CS</displayName>
					<description>Opamp 1 control register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x21000000</resetValue>
					<fields>
						<field>
							<name>OUTSEL</name>
							<description>OUTSEL</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VMSEL</name>
							<description>VMSEL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>VPSEL</name>
							<description>VPSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>GAIN</name>
							<description>GAIN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>MOD</name>
							<description>MOD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OPAMP2_CS</name>
					<displayName>OPAMP2_CS</displayName>
					<description>Opamp 2 control register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>GAIN</name>
							<description>GAIN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>MOD</name>
							<description>MOD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OPAMP3_CS</name>
					<displayName>OPAMP3_CS</displayName>
					<description>Opamp 3 control register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>GAIN</name>
							<description>GAIN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>MOD</name>
							<description>MOD</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OPAMP_LOCK</name>
					<displayName>OPAMP_LOCK</displayName>
					<description>Opamp123 lock register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000000</resetValue>
					<fields>
						<field>
							<name>OPALK</name>
							<description>OPALK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OPAMP_VREFSEL</name>
					<displayName>OPAMP_VREFSEL</displayName>
					<description>Opamp1 reference voltage selection register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000000</resetValue>
					<fields>
						<field>
							<name>OPA3SEL</name>
							<description>OPA3SEL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OPA2SEL</name>
							<description>OPA2SEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OPA1SEL</name>
							<description>OPA1SEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
