Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
			</registers>
		</peripheral>
        
        <peripheral>
			<name>PWR</name>
			<description>PWR</description>
			<groupName>PWR</groupName>
			<baseAddress>0x40007000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PVD</name>
				<description>PVD interrupt</description>
				<value>0</value>
			</interrupt>
			<registers>
				<register>
					<name>PWR_CTRL</name>
					<displayName>PWR_CTRL</displayName>
					<description>Power Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00785000</resetValue>
					<fields>
						<field>
							<name>NRSTCNT</name>
							<description>NRSTCNT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>PVDCNT</name>
							<description>PVDCNT</description>
							<bitOffset>14</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>IWDGRSTEN</name>
							<description>IWDGRSTEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PLS</name>
							<description>PLS</description>
							<bitOffset>5</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>PVDEN</name>
							<description>PVDEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PWR_CTRLSTS</name>
					<displayName>PWR_CTRLSTS</displayName>
					<description>Power Control/Status Register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PVDO</name>
							<description>PVDO</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PWR_CTRL2</name>
					<displayName>PWR_CTRL2</displayName>
					<description>Power Control Register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000007e1</resetValue>
					<fields>
						<field>
							<name>MRLPDLY</name>
							<description>MRLPDLY</description>
							<bitOffset>1</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>MRLPEN</name>
							<description>MRLPEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DBG_CTRL</name>
					<displayName>DBG_CTRL</displayName>
					<description>DBG MCU register. </description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TIM6STP</name>
							<description>TIM6STP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2TIMOUT</name>
							<description>I2C2TIMOUT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1TIMOUT</name>
							<description>I2C1TIMOUT</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM4STP</name>
							<description>TIM4STP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3STP</name>
							<description>TIM3STP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM1STP</name>
							<description>TIM1STP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDGSTP</name>
							<description>IWDGSTP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
    
        <peripheral>
			<name>RCC</name>
			<description>RCC</description>
			<groupName>RCC</groupName>
			<baseAddress>0x40021000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>RCC_CTRL</name>
					<displayName>RCC_CTRL</displayName>
					<description>nan</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00400601</resetValue>
					<fields>
						<field>
							<name>HSITRIM</name>
							<description>HSITRIM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>LSICALCF</name>
							<description>LSICALCF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSICALLEN</name>
							<description>LSICALLEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>LSICALEN</name>
							<description>LSICALEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDF</name>
							<description>HSIRDF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIEN</name>
							<description>HSIEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_CFG</name>
					<displayName>RCC_CFG</displayName>
					<description>nan</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x20000400</resetValue>
					<fields>
						<field>
							<name>MCOPRES</name>
							<description>MCOPRES</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>MCO</name>
							<description>MCO</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SYSPRES</name>
							<description>SYSPRES</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMXCLKSEL</name>
							<description>TIMXCLKSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6CLKSEL</name>
							<description>TIM6CLKSEL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART3CLKSEL</name>
							<description>UART3CLKSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>APBPRES</name>
							<description>APBPRES</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>AHBPRES</name>
							<description>AHBPRES</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SCLKSTS</name>
							<description>SCLKSTS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SCLKSW</name>
							<description>SCLKSW</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_CLKINT</name>
					<displayName>RCC_CLKINT</displayName>
					<description>nan</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSIRDCLR</name>
							<description>HSIRDCLR</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDCLR</name>
							<description>LSIRDCLR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSIRDF</name>
							<description>HSIRDF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSIRDF</name>
							<description>LSIRDF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APBPRST</name>
					<displayName>RCC_APBPRST</displayName>
					<description>nan</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
					    <field>
							<name>OPARST</name>
							<description>OPARST</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMPRST</name>
							<description>COMPRST</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART3RST</name>
							<description>UART3RST</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART2RST</name>
							<description>UART2RST</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART1RST</name>
							<description>UART1RST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6RST</name>
							<description>TIM6RST</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM4RST</name>
							<description>TIM4RST</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3RST</name>
							<description>TIM3RST</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM1RST</name>
							<description>TIM1RST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2RST</name>
							<description>SPI2RST</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1RST</name>
							<description>SPI1RST</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PWRRST</name>
							<description>PWRRST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2RST</name>
							<description>I2C2RST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1RST</name>
							<description>I2C1RST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOMRST</name>
							<description>IOMRST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_AHBPCLKEN</name>
					<displayName>RCC_AHBPCLKEN</displayName>
					<description>nan</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00</resetValue>
					<fields>
						<field>
							<name>ADCEN</name>
							<description>ADCEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HDIVEN</name>
							<description>HDIVEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SQRTEN</name>
							<description>SQRTEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>DMAEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APBPCLKEN</name>
					<displayName>RCC_APBPCLKEN</displayName>
					<description>nan</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OPAEN</name>
							<description>OPAEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMPFILTEN</name>
							<description>COMPFILTEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMPEN</name>
							<description>COMPEN</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART3EN</name>
							<description>UART3EN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART2EN</name>
							<description>UART2EN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART1EN</name>
							<description>UART1EN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6EN</name>
							<description>TIM6EN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM4EN</name>
							<description>TIM4EN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3EN</name>
							<description>TIM3EN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM1EN</name>
							<description>TIM1EN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2EN</name>
							<description>SPI2EN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1EN</name>
							<description>SPI1EN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PWREN</name>
							<description>PWREN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2EN</name>
							<description>I2C2EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1EN</name>
							<description>I2C1EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOMEN</name>
							<description>IOMEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_CTRLSTS</name>
					<displayName>RCC_CTRLSTS</displayName>
					<description>nan</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x018</resetValue>
					<fields>
						<field>
							<name>LKUPRSTF</name>
							<description>LKUPRSTF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMCGBNF</name>
							<description>EMCGBNF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EMCGBF</name>
							<description>EMCGBF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GLITCHRSTF</name>
							<description>GLITCHRSTF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDGRSTF</name>
							<description>IWDGRSTF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SFTRSTF</name>
							<description>SFTRSTF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PORRSTF</name>
							<description>PORRSTF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PINRSTF</name>
							<description>PINRSTF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RMRSTF</name>
							<description>RMRSTF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RC_AHBPRST</name>
					<displayName>RC_AHBPRST</displayName>
					<description>nan</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<fields>
						<field>
							<name>ADCRST</name>
							<description>ADCRST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HDIVRST</name>
							<description>HDIVRST</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SQRTRST</name>
							<description>SQRTRST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_CFG2</name>
					<displayName>RCC_CFG2</displayName>
					<description>nan</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ADCHPRE</name>
							<description>ADCHPRE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_LSICAL</name>
					<displayName>RCC_LSICAL</displayName>
					<description>nan</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HSICALCNT</name>
							<description>HSICALCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_EMCCTRL</name>
					<displayName>RCC_EMCCTRL</displayName>
					<description>nan</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LKUPRSTEN</name>
							<description>LKUPRSTEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GBNSW</name>
							<description>GBNSW</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GBNRST</name>
							<description>GBNRST</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GBNDET</name>
							<description>GBNDET</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GBNDETSEL</name>
							<description>GBNDETSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>GBSW</name>
							<description>GBSW</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GBRST</name>
							<description>GBRST</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GBDET</name>
							<description>GBDET</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GBDETSEL</name>
							<description>GBDETSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>GVSW</name>
							<description>GVSW</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GVRST</name>
							<description>GVRST</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GVDET</name>
							<description>GVDET</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GVDETSEL</name>
							<description>GVDETSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_LSCTRL</name>
					<displayName>RCC_LSCTRL</displayName>
					<description>nan</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000140</resetValue>
					<fields>
						<field>
							<name>TRIMSEL</name>
							<description>TRIMSEL</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSITRIM</name>
							<description>LSITRIM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_TIMFILTCFG</name>
					<displayName>RCC_TIMFILTCFG</displayName>
					<description>nan</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
					    <field>
							<name>IOFLITCLK</name>
							<description>IOFLITCLK</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TIM4FILTCLK</name>
							<description>TIM4FILTCLK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>TIM3FILTCLK</name>
							<description>TIM3FILTCLK</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>TIM1FILTCLK</name>
							<description>TIM1FILTCLK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
					</fields>
				</register>
