Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
			</registers>
		</peripheral>
        
        <peripheral>
			<name>UART1</name>
			<description>UART1</description>
			<groupName>UART</groupName>
			<baseAddress>0x40013800</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>UART1</name>
				<description>UART1 global interrupt</description>
				<value>4</value>
			</interrupt>
			<registers>
                <register>
					<name>UART_CTRL1</name>
					<displayName>UART_CTRL1</displayName>
					<description>UART Baud rate register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>SWAP</name>
							<description>SWAP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OSPM</name>
							<description>OSPM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DEAT</name>
							<description>DEAT</description>
							<bitOffset>21</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>DEDT</name>
							<description>DEDT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>DEP</name>
							<description>DEP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DEM</name>
							<description>DEM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDBRK</name>
							<description>SDBRK</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEIEN</name>
							<description>PEIEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXCIEN</name>
							<description>TXCIEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXDEIEN</name>
							<description>TXDEIEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXDNEIEN</name>
							<description>RXDNEIEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDLEIEN</name>
							<description>IDLEIEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WUM</name>
							<description>WUM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RCVWU</name>
							<description>RCVWU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WL</name>
							<description>WL</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PCEN</name>
							<description>PCEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PSEL</name>
							<description>PSEL</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXEN</name>
							<description>TXEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXEN</name>
							<description>RXEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UEN</name>
							<description>UEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>UART_CTRL2</name>
					<displayName>UART_CTRL2</displayName>
					<description>UART Baud rate register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RTOITE</name>
							<description>RTOITE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTOCF</name>
							<description>RTOCF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTOEN</name>
							<description>RTOEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LINBDL</name>
							<description>LINBDL</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LINBDIEN</name>
							<description>LINBDIEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LINMEN</name>
							<description>LINMEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STPB</name>
							<description>STPB</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>ADDR</name>
							<description>ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
                <register>
					<name>UART_CTRL3</name>
					<displayName>UART_CTRL3</displayName>
					<description>UART Baud rate register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>IRDALP</name>
							<description>IRDALP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IRDAMEN</name>
							<description>IRDAMEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ERRIEN</name>
							<description>ERRIEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMARXEN</name>
							<description>DMARXEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMATXEN</name>
							<description>DMATXEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HDMEN</name>
							<description>HDMEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
                <register>
					<name>UART_STS</name>
					<displayName>UART_STS</displayName>
					<description>UART Status register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0180</resetValue>
					<fields>
                        <field>
							<name>RTOF</name>
							<description>RTOF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FEF</name>
							<description>FEF</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NEF</name>
							<description>NEF</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OREF</name>
							<description>OREF</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PEF</name>
							<description>PEF</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LINBDF</name>
							<description>LINBDF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RXDNE</name>
							<description>RXDNE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXC</name>
							<description>TXC</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXDE</name>
							<description>TXDE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDLEF</name>
							<description>IDLEF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
                <register>
					<name>UART_DAT</name>
					<displayName>UART_DAT</displayName>
					<description>UART Data register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DATV</name>
							<description>DATV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
					</fields>
				</register>
                <register>
					<name>UART_BRCF</name>
					<displayName>UART_BRCF</displayName>
					<description>UART Baud rate register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DIV_Integer</name>
							<description>DIV_Integer</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>DIV_Decimal</name>
							<description>DIV_Decimal</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
                <register>
					<name>UART_GTP</name>
					<displayName>UART_GTP</displayName>
					<description>USART Baud rate register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PSCV</name>
							<description>PSCV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>UART_RTO</name>
					<displayName>UART_RTO</displayName>
					<description>UART receiver timeout value.</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TIME</name>
							<description>TIME</description>
							<bitOffset>0</bitOffset>
							<bitWidth>28</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>UART_WKUP</name>
					<displayName>UART_WKUP</displayName>
					<description>UART WAKE UP register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DATCLR</name>
							<description>DATCLR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EN</name>
							<description>EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
