Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
			</registers>
		</peripheral>
        
        <peripheral derivedFrom="UART1">
            <name>UART2</name>
            <baseAddress>0x40004400</baseAddress>
            <interrupt>
                <name>UART2</name>
                <description>UART2 interrupt</description>
                <value>5</value>
            </interrupt> 
		</peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART3</name>
            <baseAddress>0x40004800</baseAddress>
            <interrupt>
                <name>UART3</name>
                <description>UART3 interrupt</description>
                <value>14</value>
            </interrupt> 
		</peripheral>
    
        <peripheral>
			<name>HDIV</name>
			<description>HDIV</description>
			<groupName>HDIV</groupName>
			<baseAddress>0x40028000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>HDIV_CTRLSTS</name>
					<displayName>HDIV_CTRLSTS</displayName>
					<description>nan</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>TYPESEL</name>
							<description>TYPESEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AUTOSTART</name>
							<description>AUTOSTART</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BUSHOLD</name>
							<description>BUSHOLD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HDIVDF</name>
							<description>HDIVDF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HDIVSTART</name>
							<description>HDIVSTART</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HDIVEN</name>
							<description>HDIVEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HDIV_DIVIDEND</name>
					<displayName>HDIV_DIVIDEND</displayName>
					<description>Dividend data</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DIVIDEND</name>
							<description>DIVIDEND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HDIV_DIVISOR</name>
					<displayName>HDIV_DIVISOR</displayName>
					<description>Divisor data</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>DIVISOR</name>
							<description>DIVISOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HDIV_QUOTIENT</name>
					<displayName>HDIV_QUOTIENT</displayName>
					<description>quotient data</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>QUOTIENT</name>
							<description>QUOTIENT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HDIV_REMAINDER</name>
					<displayName>HDIV_REMAINDER</displayName>
					<description>Remainder data</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>REMAINDER</name>
							<description>REMAINDER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>HDIV_DIVBY0</name>
					<displayName>HDIV_DIVBY0</displayName>
					<description>nan</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>HDIV_DIVBY0</name>
							<description>HDIV_DIVBY0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
    
        <peripheral>
			<name>SQRT</name>
			<description>SQRT</description>
			<groupName>SQRT</groupName>
			<baseAddress>0x40020400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SQRT_CTRLSTS</name>
					<displayName>SQRT_CTRLSTS</displayName>
					<description>nan</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>AUTOSTART</name>
							<description>AUTOSTART</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BUSHOLD</name>
							<description>BUSHOLD</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SQRTDF</name>
							<description>SQRTDF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SQRTSTART</name>
							<description>SQRTSTART</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SQRTEN</name>
							<description>SQRTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SQRT_RADICAND</name>
					<displayName>SQRT_RADICAND</displayName>
					<description>Radicant value</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>RADICAND</name>
							<description>RADICAND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SQRT_ROOT</name>
					<displayName>SQRT_ROOT</displayName>
					<description>nan</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ROOT</name>
							<description>ROOT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
