Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
				<register>
					<name>TIMx_CCMOD3</name>
					<displayName>TIMx_CCMOD3</displayName>
					<description>TIM compare mode register 3</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OC7MD</name>
							<description>OC7MD</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>OC7CEN</name>
							<description>OC7CEN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC7FEN</name>
							<description>OC7FEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC7PEN</name>
							<description>OC7PEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC6MD</name>
							<description>OC6MD</description>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>OC6CEN</name>
							<description>OC6CEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC6FEN</name>
							<description>OC6FEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC6PEN</name>
							<description>OC6PEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC5MD</name>
							<description>OC5MD</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>OC5CEN</name>
							<description>OC5CEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC5FEN</name>
							<description>OC5FEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC5PEN</name>
							<description>OC5PEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCEN</name>
					<displayName>TIMx_CCEN</displayName>
					<description>TIM capture/compare enable register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CC7P</name>
							<description>CC7P</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC7EN</name>
							<description>CC7EN</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC6P</name>
							<description>CC6P</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC6EN</name>
							<description>CC6EN</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC5P</name>
							<description>CC5P</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC5EN</name>
							<description>CC5EN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC4P</name>
							<description>CC4P</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC4EN</name>
							<description>CC4EN</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC4NP</name>
							<description>CC4NP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC4NEN</name>
							<description>CC4NEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3P</name>
							<description>CC3P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3EN</name>
							<description>CC3EN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3NP</name>
							<description>CC3NP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3NEN</name>
							<description>CC3NEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2P</name>
							<description>CC2P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2EN</name>
							<description>CC2EN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2NP</name>
							<description>CC2NP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2NEN</name>
							<description>CC2NEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1P</name>
							<description>CC1P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1EN</name>
							<description>CC1EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1NP</name>
							<description>CC1NP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1NEN</name>
							<description>CC1NEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCDAT1</name>
					<displayName>TIMx_CCDAT1</displayName>
					<description>TIM capture/compare register 1</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCDDAT1</name>
							<description>CCDDAT1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>CCDAT1</name>
							<description>CCDAT1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCDAT2</name>
					<displayName>TIMx_CCDAT2</displayName>
					<description>TIM capture/compare register 2</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCDDAT2</name>
							<description>CCDDAT2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>CCDAT2</name>
							<description>CCDAT2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCDAT3</name>
					<displayName>TIMx_CCDAT3</displayName>
					<description>TIM capture/compare register 3</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCDDAT3</name>
							<description>CCDDAT3</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>CCDAT3</name>
							<description>CCDAT3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCDAT4</name>
					<displayName>TIMx_CCDAT4</displayName>
					<description>TIM capture/compare register 4</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCDDAT4</name>
							<description>CCDDAT4</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>CCDAT4</name>
							<description>CCDAT4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCDAT5</name>
					<displayName>TIMx_CCDAT5</displayName>
					<description>TIM capture/compare register 5</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCDAT5</name>
							<description>CCDAT5</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCDAT6</name>
					<displayName>TIMx_CCDAT6</displayName>
					<description>TIM capture/compare register 6</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCDAT6</name>
							<description>CCDAT6</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_PSC</name>
					<displayName>TIMx_PSC</displayName>
					<description>TIM prescaler</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<description>PSC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_AR</name>
					<displayName>TIMx_AR</displayName>
					<description>TIM auto-reload register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000ffff</resetValue>
					<fields>
						<field>
							<name>ARR</name>
							<description>ARR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CNT</name>
					<displayName>TIMx_CNT</displayName>
					<description>TIM counter</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_REPCNT</name>
					<displayName>TIMx_REPCNT</displayName>
					<description>TIM repetition counter register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REPCNT</name>
							<description>REPCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_BKDT</name>
					<displayName>TIMx_BKDT</displayName>
					<description>TIM Break and Deadtime control register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LOCKCFG</name>
							<description>LOCKCFG</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OSSR</name>
							<description>OSSR</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OSSI</name>
							<description>OSSI</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BKEN</name>
							<description>BKEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BKP</name>
							<description>BKP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AOEN</name>
							<description>AOEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MOEN</name>
							<description>MOEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTGN</name>
							<description>DTGN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCDAT7</name>
					<displayName>TIMx_CCDAT7</displayName>
					<description>TIM compare register 7</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCDAT7</name>
							<description>CCDAT7</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_BKFR</name>
					<displayName>TIMx_BKFR</displayName>
					<description>TIM break 1 Filter</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>THRESH</name>
							<description>THRESH</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>WSIZE</name>
							<description>WSIZE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>FEN</name>
							<description>FEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_AF1</name>
					<displayName>TIMx_AF1</displayName>
					<description>TIM AF1</description>
					<addressOffset>0x7c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IOM4BRKP</name>
							<description>IOM4BRKP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOM3BRKP</name>
							<description>IOM3BRKP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOM2BRKP</name>
							<description>IOM2BRKP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOM4BRKEN</name>
							<description>IOM4BRKEN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOM3BRKEN</name>
							<description>IOM3BRKEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOM2BRKEN</name>
							<description>IOM2BRKEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP1BRKP</name>
							<description>COMP1BRKP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOMBRKP</name>
							<description>IOMBRKP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP1BRKEN</name>
							<description>COMP1BRKEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOMBRKEN</name>
							<description>IOMBRKEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_DCTRL</name>
					<displayName>TIMx_DCTRL</displayName>
					<description>TIM DMA control register</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DBADDR</name>
							<description>DBADDR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>DBLEN</name>
							<description>DBLEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_DADDR</name>
					<displayName>TIMx_DADDR</displayName>
					<description>TIM DMA address for full transfer</description>
					<addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BURST</name>
							<description>BURST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
