Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
				<register>
					<name>TIMx_BKDT</name>
					<displayName>TIMx_BKDT</displayName>
					<description>TIM Break and Deadtime control register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LOCKCFG</name>
							<description>LOCKCFG</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>BKEN</name>
							<description>BKEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BKP</name>
							<description>BKP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AOEN</name>
							<description>AOEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MOEN</name>
							<description>MOEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_BKFR</name>
					<displayName>TIMx_BKFR</displayName>
					<description>TIM break 1 Filter</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>THRESH</name>
							<description>THRESH</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>WSIZE</name>
							<description>WSIZE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>FEN</name>
							<description>FEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_AF1</name>
					<displayName>TIMx_AF1</displayName>
					<description>TIM AF1</description>
					<addressOffset>0x7c</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IOM4BRKP</name>
							<description>IOM4BRKP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOM3BRKP</name>
							<description>IOM3BRKP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOM2BRKP</name>
							<description>IOM2BRKP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOM4BRKEN</name>
							<description>IOM4BRKEN</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOM3BRKEN</name>
							<description>IOM3BRKEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOM2BRKEN</name>
							<description>IOM2BRKEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP1BRKP</name>
							<description>COMP1BRKP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOMBRKP</name>
							<description>IOMBRKP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>COMP1BRKEN</name>
							<description>COMP1BRKEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IOMBRKEN</name>
							<description>IOMBRKEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_ENCMLV</name>
					<displayName>TIMx_ENCMLV</displayName>
					<description>GTIM Load Value (LVR) of counter register</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LVR</name>
							<description>LVR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_DCTRL</name>
					<displayName>TIMx_DCTRL</displayName>
					<description>GTIM DMA control register</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DBADDR</name>
							<description>DBADDR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>DBLEN</name>
							<description>DBLEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_DADDR</name>
					<displayName>TIMx_DADDR</displayName>
					<description>GTIM DMA address for full transfer</description>
					<addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BURST</name>
							<description>BURST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
        
        <peripheral>
			<name>TIM4</name>
			<description>TIM4</description>
			<groupName>TIM</groupName>
			<baseAddress>0x40013400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIM4</name>
				<description>TIM4 global interrupt</description>
				<value>11</value>
			</interrupt>
			<registers>
				<register>
					<name>TIMx_CTRL1</name>
					<displayName>TIMx_CTRL1</displayName>
					<description>GTIM control register1</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>C1SEL</name>
							<description>C1SEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CLRSEL</name>
							<description>CLRSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ARPEN</name>
							<description>ARPEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ONEPM</name>
							<description>ONEPM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPDIS</name>
							<description>UPDIS</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPRS</name>
							<description>UPRS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAMSEL</name>
							<description>CAMSEL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DIR</name>
							<description>DIR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CNTEN</name>
							<description>CNTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CTRL2</name>
					<displayName>TIMx_CTRL2</displayName>
					<description>GTIM control register2</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TI1SEL</name>
							<description>TI1SEL</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CCDSEL</name>
							<description>CCDSEL</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MMSEL</name>
							<description>MMSEL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_STS</name>
					<displayName>TIMx_STS</displayName>
					<description>GTIM status register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TITF</name>
							<description>TITF</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UDITF</name>
							<description>UDITF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3OCF</name>
							<description>CC3OCF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2OCF</name>
							<description>CC2OCF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1OCF</name>
							<description>CC1OCF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>C3LDCNTITF</name>
							<description>C3LDCNTITF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3ITF</name>
							<description>CC3ITF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2ITF</name>
							<description>CC2ITF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1ITF</name>
							<description>CC1ITF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_EVTGEN</name>
					<displayName>TIMx_EVTGEN</displayName>
					<description>GTIM event generation register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TGN</name>
							<description>TGN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UDGN</name>
							<description>UDGN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3GN</name>
							<description>CC3GN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2GN</name>
							<description>CC2GN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1GN</name>
							<description>CC1GN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_SMCTRL</name>
					<displayName>TIMx_SMCTRL</displayName>
					<description>GTIM slave mode control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MSMD</name>
							<description>MSMD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTF</name>
							<description>EXTF</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTP</name>
							<description>EXTP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXCEN</name>
							<description>EXCEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTPS</name>
							<description>EXTPS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SMSEL</name>
							<description>SMSEL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>TSEL</name>
							<description>TSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_DINTEN</name>
					<displayName>TIMx_DINTEN</displayName>
					<description>GTIM DMA/Interrupt enable register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TDEN</name>
							<description>TDEN</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UDEN</name>
							<description>UDEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIEN</name>
							<description>TIEN</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UIEN</name>
							<description>UIEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3DEN</name>
							<description>CC3DEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2DEN</name>
							<description>CC2DEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1DEN</name>
							<description>CC1DEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>C3LDCNTIEN</name>
							<description>C3LDCNTIEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3IEN</name>
							<description>CC3IEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2IEN</name>
							<description>CC2IEN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1IEN</name>
							<description>CC1IEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCMOD1_OUTPUT</name>
					<displayName>TIMx_CCMOD1_OUTPUT</displayName>
					<description>TIM capture/compare mode register 1 (output mode)</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OC2MD</name>
							<description>OC2MD</description>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>OC2CEN</name>
							<description>OC2CEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC2FEN</name>
							<description>OC2FEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC2PEN</name>
							<description>OC2PEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2SEL</name>
							<description>CC2SEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OC1MD</name>
							<description>OC1MD</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>OC1CEN</name>
							<description>OC1CEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC1FEN</name>
							<description>OC1FEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC1PEN</name>
							<description>OC1PEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1SEL</name>
							<description>CC1SEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCMOD1_INTPUT</name>
					<displayName>TIMx_CCMOD1_INTPUT</displayName>
					<description>TIM capture/compare mode register 1 (intput mode)</description>
					<alternateRegister>TIMx_CCMOD1_OUTPUT</alternateRegister>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IC2F</name>
							<description>IC2F</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>IC2PSC</name>
							<description>IC2PSC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CC2SEL</name>
							<description>CC2SEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>IC1F</name>
							<description>IC1F</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>IC1PSC</name>
							<description>IC1PSC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CC1SEL</name>
							<description>CC1SEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCMOD2_OUTPUT</name>
					<displayName>TIMx_CCMOD2_OUTPUT</displayName>
					<description>TIM capture/compare mode register 2 (output mode)</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OC4MD</name>
							<description>OC4MD</description>
							<bitOffset>13</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>OC4CEN</name>
							<description>OC4CEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC4FEN</name>
							<description>OC4FEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC4PEN</name>
							<description>OC4PEN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC4SEL</name>
							<description>CC4SEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>OC3MD</name>
							<description>OC3MD</description>
							<bitOffset>5</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>OC3CEN</name>
							<description>OC3CEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC3FEN</name>
							<description>OC3FEN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OC3PEN</name>
							<description>OC3PEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3SEL</name>
							<description>CC3SEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCMOD2_INTPUT</name>
					<displayName>TIMx_CCMOD2_INTPUT</displayName>
					<description>TIM capture/compare mode register 2 (intput mode)</description>
					<alternateRegister>TIMx_CCMOD2_OUTPUT</alternateRegister>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IC3F</name>
							<description>IC3F</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>IC3PSC</name>
							<description>IC3PSC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CC3SEL</name>
							<description>CC3SEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCEN</name>
					<displayName>TIMx_CCEN</displayName>
					<description>GTIM capture/compare enable register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CC3P</name>
							<description>CC3P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC3EN</name>
							<description>CC3EN</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2P</name>
							<description>CC2P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC2EN</name>
							<description>CC2EN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1P</name>
							<description>CC1P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CC1EN</name>
							<description>CC1EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCDAT1</name>
					<displayName>TIMx_CCDAT1</displayName>
					<description>GTIM capture/compare register 1</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCDAT1</name>
							<description>CCDAT1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCDAT2</name>
					<displayName>TIMx_CCDAT2</displayName>
					<description>GTIM capture/compare register 2</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCDAT2</name>
							<description>CCDAT2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CCDAT3</name>
					<displayName>TIMx_CCDAT3</displayName>
					<description>GTIM capture/compare register 3</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CCDAT3</name>
							<description>CCDAT3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
