Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
				<register>
					<name>TIMx_PSC</name>
					<displayName>TIMx_PSC</displayName>
					<description>GTIM prescaler register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<description>PSC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_ARR</name>
					<displayName>TIMx_ARR</displayName>
					<description>GTIM auto-reload register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xffffffff</resetValue>
					<fields>
						<field>
							<name>ARR</name>
							<description>ARR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CNT</name>
					<displayName>TIMx_CNT</displayName>
					<description>GTIM counter  register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_C1FILT</name>
					<displayName>TIMx_C1FILT</displayName>
					<description>GTIM channal 1 input Filter</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>THRESH</name>
							<description>THRESH</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>WSIZE</name>
							<description>WSIZE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>FEN</name>
							<description>FEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_C2FILT</name>
					<displayName>TIMx_C2FILT</displayName>
					<description>GTIM channal 2 input Filter</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>THRESH</name>
							<description>THRESH</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>WSIZE</name>
							<description>WSIZE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>FEN</name>
							<description>FEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_C3FILT</name>
					<displayName>TIMx_C3FILT</displayName>
					<description>GTIM channal 3 input Filter</description>
					<addressOffset>0x6C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>THRESH</name>
							<description>THRESH</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>WSIZE</name>
							<description>WSIZE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>FEN</name>
							<description>FEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_FILTO</name>
					<displayName>TIMx_FILTO</displayName>
					<description>GTIM channel filter output</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>C3FILTO</name>
							<description>C3FILTO</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>C2FILTO</name>
							<description>C2FILTO</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>C1FILTO</name>
							<description>C1FILTO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_ENCDAT</name>
					<displayName>TIMx_ENCDAT</displayName>
					<description>GTIM encoder capture data register.</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ENCDAT</name>
							<description>ENCDAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_ENCMCTRL</name>
					<displayName>TIMx_ENCMCTRL</displayName>
					<description>GTIM encoder mode conctrl register</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ENCDATS</name>
							<description>ENCDATS</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ENCMD</name>
							<description>ENCMD</description>
							<bitOffset>3</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>C3LDCNTSEL</name>
							<description>C3LDCNTSEL</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>C3LDCNTEN</name>
							<description>C3LDCNTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_ENCLVR</name>
					<displayName>TIMx_ENCLVR</displayName>
					<description>GTIM Load Value (LVR) of counter register</description>
					<addressOffset>0x90</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LVR</name>
							<description>LVR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_DCTRL</name>
					<displayName>TIMx_DCTRL</displayName>
					<description>GTIM DMA control register</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DBADDR</name>
							<description>DBADDR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
						<field>
							<name>DBLEN</name>
							<description>DBLEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_DADDR</name>
					<displayName>TIMx_DADDR</displayName>
					<description>GTIM DMA address for full transfer</description>
					<addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BURST</name>
							<description>BURST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
