Nsing-Community/Nsing-Pack/Nations_Device_PACK_Add_To_IAR_Tool/Nations Device PACK/debugger/Nsing/N32G033/N32G033.svd
			</registers>
		</peripheral>
        
        <peripheral>
			<name>TIM6</name>
			<description>TIM6</description>
			<groupName>TIM</groupName>
			<baseAddress>0x40001000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>TIM6</name>
				<description>TIM6 global interrupt</description>
				<value>13</value>
			</interrupt>
			<registers>
				<register>
					<name>TIMx_CTRL1</name>
					<displayName>TIMx_CTRL1</displayName>
					<description>TIM control register1</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ARPEN</name>
							<description>ARPEN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ONEPM</name>
							<description>ONEPM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPDIS</name>
							<description>UPDIS</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPRS</name>
							<description>UPRS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CNTEN</name>
							<description>CNTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_STS</name>
					<displayName>TIMx_STS</displayName>
					<description>TIM status register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UDITF</name>
							<description>UDITF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_EVTGEN</name>
					<displayName>TIMx_EVTGEN</displayName>
					<description>TIM event generation register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UDGN</name>
							<description>UDGN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_DINTEN</name>
					<displayName>TIMx_DINTEN</displayName>
					<description>TIM DMA/Interrupt enable register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UDEN</name>
							<description>UDEN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UIEN</name>
							<description>UIEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_PSC</name>
					<displayName>TIMx_PSC</displayName>
					<description>TIM prescaler register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<description>PSC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_AR</name>
					<displayName>TIMx_AR</displayName>
					<description>TIM auto-reload register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xffffffff</resetValue>
					<fields>
						<field>
							<name>AR</name>
							<description>AR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMx_CNT</name>
					<displayName>TIMx_CNT</displayName>
					<description>TIM counter  register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
        
    </peripherals>
</device>
